# -*- coding: utf-8 -*-

category_and_id = {
    '防洪排涝和排水类': '2c93808e6bacbd79016be3ea8d01040d',
    '水资源和水土保持类': '2c93808e6bacbd79016be3ea4160040b',
    '在建水务工程类': '2c93808e6bacbd79016be3eabbc8040e'
}

category_and_task_id_prefix = {
    '防洪排涝和排水类': 'PS',
    '水资源和水土保持类': 'ST',
    '在建水务工程类': 'GC'
}

department_and_id = {
    '宝安区水务局':	'ff80818166a4bb600166a4c0b01e0002',
    '水资源和供水管理办公室': '1b713328cb484c23be3301ba42627ab1',
    '罗田水库管理站':	'640fd73cc32448258a3a2278e9a6295f',
    '长流陂水库管理站': '25901ef5a7d44f3391122d2b1c6656e5',
    '防洪排涝和排水管理科': '12b7366814714097b652902898829087',
    '技术监管中心': 'e6ad6783ed5e49fa841f1889facc4e2e',
    '水污染治理科（规划发展科）': '9f5ee398ee014ad78e5ad198bac1c659',
    '水政监察大队': '762aaf20ef7e4a9bb226984963f43d6e',
    '工程事务中心': '138c296efc1a4007b647b9b7f80429de',
    '主任':'2da4ee4ff44d46bfa51f3e87b68b3004',
    '副主任': '0da5d81dc2a64e05ba3f6d5ca76217f1',
    '科员': '877d9659e59a4ae592ab8d1be3164af6',
    '总部': '7cfda88ebbc2457e94d21b793afdf0e9',
    '智慧管控部': 'b7854a56978243618fe8e2a67fa7e983'
}

detachment_and_id = {
    '新安水政监察中队': '9854e6b6f91843539865012ee662c4fc',
    '西乡水政监察中队': 'fc0c8db5fce94074b77c37de2c05edee',
    '航城水政监察中队': 'a6c42874627e4246be0fce98b71d6d5d',
    '福永水政监察中队': '63eb40ee72184c3a98448fbf14e59c40',
    '福海水政监察中队': '553a741a5cce4f42a469a66b62026e23',
    '沙井水政监察中队': '71d054f5f21b47cb8c9508a5ab71bfce',
    '新桥水政监察中队': '4cd6bb08d3734f3a8dd51bc1453f84f5',
    '松岗水政监察中队': 'de7939002c4d42cfabc49baf3bca4501',
    '燕罗水政监察中队': '3b01909eb22e4f029ce63bf916b56d63',
    '石岩水政监察中队': '7a29222e8d194d5580a5c355867cd426'
}

territory_and_id = {
    '新安': '2c9380826c2df926016c4274debc0048',
    '西乡': '2c9380826c2df926016c42763c07004a',
    '航城': '2c9380826c2df926016c42767c37004b',
    '福永': '2c9380826c2df926016c427925480052',
    '福海': '2c9380826c2df926016c427946a10053',
    '新桥': '2c9380826c2df926016c4279675d0054',
    '沙井': '2c9380826c2df926016c4279a0e70055',
    '燕罗': '2c9380826c2df926016c4279c8cc0056',
    '石岩': '2c9380826c2df926016c427a28620057',
    '松岗': '2c9380826c2df926016c4278ead60051'
}